--======УЛИЧНЫЕ ПЕРЕХОДЫ ИЗ КОРПУСОВ========
--=выполнено с помощью 2gis=

--Уличные переходы из 8 корпуса
INSERT INTO edges (id, from_point_id, to_point_id, distance_meters, direction_text, floor_transition) VALUES 
--в 6 к
(8010060, 801030, 601019, 100, '', false),
--в 7 к
(8010061, 801030, 72023, 150, '', false),
--в 1 к
(8010062, 801030, 101085, 150, '', false),
--в 16 к
(8010063, 801030, 1601001, 150, '', false),
--в 10 к
(8010060, 801030, 1001001, 300, '', false),
--в 12 к
(8010061, 801030, 1201004, 400, '', false),
(8010062, 801030, 1201045, 350, '', false),
--в 2 к
(8010063, 801030, 201062, 200, '', false),
--в 3 к
(8010064, 801030, 301021, 250, '', false),
(8010065, 801030, 301020, 280, '', false),
--в 4 к
(8010066, 801030, 401009, 250, '', false),
--в 9 к
(8010067, 801030, 901007, 300, '', false)
ON CONFLICT (id) DO NOTHING;
