-- ТОЧКИ
INSERT INTO points (id, building_id, floor_id, type, name, x_coord, y_coord, description, panorama_id, is_active) VALUES 
-- 1 этаж
(1001018, 10, 33, 1, 'Аудитория 111(10)', 70, 69.92, '', NULL, true),
(1001017, 10, 33, 3, '', 70, 72.92, '', NULL, true),
(1001016, 10, 33, 3, '', 66.5, 72.92, '', NULL, true),
(1001015, 10, 33, 1, 'Туалет женский', 51.78, 45.5, '', NULL, true),
(1001014, 10, 33, 1, 'Туалет мужской', 51.78, 34.17, '', NULL, true),
(1001013, 10, 33, 1, 'Аудитория 110(10)', 60.64, 59.18, '', NULL, true),
(1001012, 10, 33, 1, 'Аудитория 109(10)', 54.4, 59.18, '', NULL, true),
(1001011, 10, 33, 3, '', 49.5, 56, '', NULL, true),
(1001010, 10, 33, 1, 'Аудитория 103(10)', 14.5, 52.74, '', NULL, true),
(1001009, 10, 33, 1, 'Аудитория 102(10)', 14.5, 68.74, '', NULL, true),
(1001008, 10, 33, 1, 'Тренажерный зал', 40.36, 31.67, '', NULL, true),
(1001007, 10, 33, 1, 'Аудитория 108(10)', 34.44, 48.5, '', NULL, true),
(1001006, 10, 33, 6, 'Лестница', 72.77, 86.9, '', NULL, true),
(1001005, 10, 33, 3, '', 66.5, 56, '', NULL, true),
(1001004, 10, 33, 3, '', 49.5, 37.17, '', NULL, true),
(1001003, 10, 33, 6, 'Лестница', 5.75, 37.17, '', NULL, true),
(1001002, 10, 33, 3, '', 19, 37.17, '', NULL, true),
(1001001, 10, 33, 1, 'Выход', 19, 74.74, '', NULL, true),
(1001025, 10, 33, 3, '', 70, 86.9, '', NULL, true),
(1001024, 10, 33, 3, '', 60.64, 56, '', NULL, true),
(1001023, 10, 33, 3, '', 54.4, 56, '', NULL, true),
(1001022, 10, 33, 3, '', 40.36, 37.17, '', NULL, true),
(1001021, 10, 33, 3, '', 34.44, 37.17, '', NULL, true),
(1001020, 10, 33, 3, '', 19, 52.74, '', NULL, true),
(1001019, 10, 33, 3, '', 19, 68.74, '', NULL, true)
ON CONFLICT (id) DO NOTHING;

-- РЁБРА
INSERT INTO edges (id, from_point_id, to_point_id, distance_meters, direction_text, floor_transition) VALUES 
(1010001, 1001019, 1001009, 0.91, '', false),
(1010002, 1001019, 1001001, 0.64, '', false),
(1010003, 1001020, 1001010, 0.91, '', false),
(1010004, 1001020, 1001019, 1.72, '', false),
(1010005, 1001020, 1001002, 1.67, '', false),
(1010006, 1001002, 1001003, 2.69, '', false),
(1010007, 1001021, 1001002, 3.13, '', false),
(1010008, 1001021, 1001007, 1.22, '', false),
(1010009, 1001022, 1001008, 0.59, '', false),
(1010010, 1001021, 1001022, 1.2, '', false),
(1010011, 1001022, 1001004, 1.85, '', false),
(1010012, 1001004, 1001015, 1.01, '', false),
(1010013, 1001004, 1001014, 0.56, '', false),
(1010014, 1001011, 1001004, 2.02, '', false),
(1010015, 1001023, 1001011, 0.99, '', false),
(1010016, 1001023, 1001012, 0.34, '', false),
(1010017, 1001024, 1001023, 1.27, '', false),
(1010018, 1001024, 1001013, 0.34, '', false),
(1010019, 1001024, 1001005, 1.19, '', false),
(1010020, 1001005, 1001016, 1.82, '', false),
(1010021, 1001016, 1001017, 0.71, '', false),
(1010022, 1001018, 1001017, 0.32, '', false),
(1010023, 1001025, 1001017, 1.5, '', false),
(1010024, 1001025, 1001006, 0.56, '', false)
ON CONFLICT (id) DO NOTHING;

--============ 10 корпус =============
INSERT INTO panoramas (id, point_id, image_path, title, description, yaw, pitch) VALUES 
(10990001, 1001002, '/panoramas/10.1.1.jpg', 'Холл', '', 0, 0),
(10990002, 1001004, '/panoramas/10.1.2.jpg', 'Холл', '', 0, 0),
(10990003, 1001005, '/panoramas/10.1.3.jpg', 'Холл', '', 0, 0),
(10990004, 1001003, '/panoramas/10.1.л1.jpg', 'Лестница', '', 0, 0),
(10990005, 1001006, '/panoramas/10.1.л2.jpg', 'Лестница', '', 0, 0)
ON CONFLICT (id) DO NOTHING;

-- ОБНОВЛЕНИЕ ТОЧЕК (установка panorama_id)
UPDATE points SET panorama_id = 10990001 WHERE id = 1001002;
UPDATE points SET panorama_id = 10990002 WHERE id = 1001004;
UPDATE points SET panorama_id = 10990003 WHERE id = 1001005;
UPDATE points SET panorama_id = 10990004 WHERE id = 1001003;
UPDATE points SET panorama_id = 10990005 WHERE id = 1001006;
