

-- 11 1 этаж точка 

INSERT INTO points (id, building_id, floor_id, type, name, x_coord, y_coord, description, panorama_id, is_active) VALUES 
(1101020, 11, 36, 1, 'Аудитория 131/132(11)', 57, 89, '', NULL, true),
(1101019, 11, 36, 1, 'Аудитория 130(11)', 65, 89, '', NULL, true),
(1101018, 11, 36, 3, '', 61.5, 89, '', NULL, true),
(1101017, 11, 36, 1, 'Аудитория 129(11)', 65, 79.5, '', NULL, true),
(1101016, 11, 36, 3, '', 61.5, 79.5, '', NULL, true),
(1101015, 11, 36, 1, 'Аудитория 128(11)', 64.97, 66.5, '', NULL, true),
(1101014, 11, 36, 3, '', 61.5, 66.5, '', NULL, true),
(1101013, 11, 36, 1, 'Аудитория 127(11)', 65.18, 51.5, '', NULL, true),
(1101012, 11, 36, 3, '', 61.5, 51.5, '', NULL, true),
(1101011, 11, 36, 1, 'Аудитория 126(11)', 64.82, 29.16, '', NULL, true),
(1101010, 11, 36, 3, '', 61.5, 29.16, '', NULL, true),
(1101009, 11, 36, 3, '', 61.5, 21, '', NULL, true),
(1101008, 11, 36, 3, '3', 88.97, 21, '', NULL, true),
(1101007, 11, 36, 6, 'Лестница', 88.97, 9.53, '', NULL, true)

ON CONFLICT (id) DO NOTHING;

-- 11 2 этаж точка

-- ТОЧКИ
INSERT INTO points (id, building_id, floor_id, type, name, x_coord, y_coord, description, panorama_id, is_active) VALUES 
(1102014, 11, 37, 1, 'Аудитория 226(11)', 63.5, 95, '', NULL, true),
(1102013, 11, 37, 3, '', 41.5, 95.5, '', NULL, true),
(1102012, 11, 37, 3, '', 41.53, 59.5, '', NULL, true),
(1102011, 11, 37, 1, 'Аудитория 225(11)', 36, 59.5, '', NULL, true),
(1102010, 11, 37, 1, 'Аудитория 224(11)', 36.11, 36.5, '', NULL, true),
(1102009, 11, 37, 1, 'Аудитория 223(11)', 36.08, 23, '', NULL, true),
(1102008, 11, 37, 1, 'Аудитория 219(11)', 46.31, 22.77, '', NULL, true),
(1102007, 11, 37, 3, '', 41.77, 23, '', NULL, true),
(1102006, 11, 37, 3, '', 41.5, 35, '', NULL, true),
(1102005, 11, 37, 1, 'Аудитория 221/222(11)', 70.81, 39, '', NULL, true),
(1102004, 11, 37, 1, 'Аудитория 220(11)', 74, 32, '', NULL, true),
(1102003, 11, 37, 3, '', 74.29, 35.19, '', NULL, true),
(1102002, 11, 37, 3, '', 90.5, 35.5, '', NULL, true),
(1102001, 11, 37, 6, 'лестница 2 этаж(11)', 90.5, 21, '', NULL, true),
(1102015, 11, 37, 7, 'Переход из 11 в 9 корпус', 41.77, 12.5, '', NULL, true)
ON CONFLICT (id) DO NOTHING;

-- 11 1 этаж ребро

INSERT INTO edges (id, from_point_id, to_point_id, distance_meters, direction_text, floor_transition) VALUES 
(11010001, 1101008, 1101009, 3.89, '', false),
(11010002, 1101009, 1101010, 1.54, '', false),
(11010003, 1101008, 1101007, 2.17, '', false),
(11010004, 1101010, 1101011, 0.47, '', false),
(11010005, 1101010, 1101012, 4.22, '', false),
(11010006, 1101012, 1101013, 0.52, '', false),
(11010007, 1101012, 1101014, 2.84, '', false),
(11010008, 1101014, 1101015, 0.49, '', false),
(11010009, 1101014, 1101016, 2.46, '', false),
(11010010, 1101016, 1101017, 0.5, '', false),
(11010011, 1101016, 1101018, 1.8, '', false),
(11010012, 1101018, 1101019, 0.5, '', false),
(11010013, 1101018, 1101020, 0.64, '', false)
ON CONFLICT (id) DO NOTHING;

-- РЁБРА 11 2 этаж + лестница между 1 и 2
INSERT INTO edges (id, from_point_id, to_point_id, distance_meters, direction_text, floor_transition) VALUES 
(11010014, 1101007, 1102001, 6, '', true),
(11020015, 1102001, 1102002, 2.99, '', false),
(11020016, 1102002, 1102003, 2.19, '', false),
(11020017, 1102003, 1102004, 0.66, '', false),
(11020018, 1102003, 1102005, 0.92, '', false),
(11020019, 1102003, 1102006, 4.44, '', false),
(11020020, 1102006, 1102007, 2.47, '', false),
(11020021, 1102006, 1102012, 5.05, '', false),
(11020022, 1102006, 1102010, 0.79, '', false),
(11020023, 1102007, 1102009, 0.77, '', false),
(11020024, 1102007, 1102008, 0.62, '', false),
(11020025, 1102012, 1102011, 0.75, '', false),
(11020026, 1102012, 1102013, 7.42, '', false),
(11020027, 1102013, 1102014, 2.98, '', false),
(11010013, 1101018, 1101020, 0.64, '', false)
ON CONFLICT (id) DO NOTHING;
