-- 2 корпус --
-- === 1 этаж ===
-- ТОЧКИ
INSERT INTO points (id, building_id, floor_id, type, name, x_coord, y_coord, description, panorama_id, is_active) VALUES 
(200049, 2, 1, 7, 'Выход из корпуса № 2', 96.5, 50, '', NULL, true),
(200048, 2, 1, 1, 'Аудитория 108(2)', 47, 10.38, '', NULL, true),
(200047, 2, 1, 1, 'Аудитория 109(2)', 38.5, 10.38, '', NULL, true),
(200046, 2, 1, 3, '', 43, 14.97, '', NULL, true),
(200045, 2, 1, 3, '', 63.5, 14.97, '', NULL, true),
(200044, 2, 1, 3, '', 63.5, 17.33, '', NULL, true),
(200043, 2, 1, 3, '', 67, 21, '', NULL, true),
(200042, 2, 1, 1, 'Аудитория 124(2)', 68.92, 32.5, '', NULL, true),
(200041, 2, 1, 3, '', 67, 32.5, '', NULL, true),
(200040, 2, 1, 1, 'Аудитория 126(2)', 68.92, 38, '', NULL, true),
(200039, 2, 1, 3, '', 66.54, 38, '', NULL, true),
(200038, 2, 1, 1, 'Аудитория 127/128(2)', 76.41, 47, '', NULL, true),
(200037, 2, 1, 3, '', 76.41, 50, '', NULL, true),
(200036, 2, 1, 3, '', 66.54, 46, '', NULL, true),
(200035, 2, 1, 3, '', 66.54, 51, '', NULL, true),
(200034, 2, 1, 1, 'Аудитория 130(2)', 63.5, 46, '', NULL, true),
(200033, 2, 1, 1, 'Аудитория 131(2)', 63.5, 51, '', NULL, true),
(200032, 2, 1, 1, 'Аудитория 132(2)', 63.5, 56.5, '', NULL, true),
(200031, 2, 1, 1, 'Туалет мужской(2)', 77.88, 56.5, '', NULL, true),
(200030, 2, 1, 3, '', 74.21, 56.5, '', NULL, true),
(200029, 2, 1, 3, '', 67.46, 56.5, '', NULL, true),
(200028, 2, 1, 3, '', 66.46, 61.5, '', NULL, true),
(200027, 2, 1, 3, '', 66.46, 63.5, '', NULL, true),
(200026, 2, 1, 3, '', 66.46, 66.5, '', NULL, true),
(200025, 2, 1, 1, 'Аудитория 134(2)', 63.5, 63.5, '', NULL, true),
(200024, 2, 1, 1, 'Аудитория 133(2)', 69.5, 61.5, '', NULL, true),
(200023, 2, 1, 1, 'Аудитория 135(2)', 69.5, 66.5, '', NULL, true),
(200022, 2, 1, 1, 'Аудитория 142(2)', 55, 89, '', NULL, true),
(200021, 2, 1, 1, 'Аудитория 143/144(2)', 65.96, 89, '', NULL, true),
(200020, 2, 1, 3, '', 66.46, 81, '', NULL, true),
(200019, 2, 1, 1, 'Аудитория 136(2)', 69.5, 70.5, '', NULL, true),
(200018, 2, 1, 1, 'Аудитория 137(2)', 63.5, 81, '', NULL, true),
(200017, 2, 1, 1, 'Туалет женский(2)', 69.01, 81, '', NULL, true),
(200016, 2, 1, 1, 'Аудитория 139/140(2)', 79.5, 91.5, '', NULL, true),
(200015, 2, 1, 1, 'Аудитория 141(2)', 74.3, 94, '', NULL, true),
(200014, 2, 1, 3, '', 74.3, 87.5, '', NULL, true),
(200013, 2, 1, 3, '', 69.01, 87.5, '', NULL, true),
(200012, 2, 1, 3, '', 65.96, 86.5, '', NULL, true),
(200011, 2, 1, 1, 'Аудитория 145/146/147//148(2)', 41.31, 86.5, '', NULL, true),
(200010, 2, 1, 3, '', 44.88, 86.5, '', NULL, true),
(200009, 2, 1, 6, 'Лестница', 44.88, 93.5, '', NULL, true),
(200008, 2, 1, 3, '5', 74.3, 91.5, '', NULL, true),
(200007, 2, 1, 3, '4', 55, 86.5, '', NULL, true),
(200006, 2, 1, 3, '3', 66.46, 70.5, '', NULL, true),
(200005, 2, 1, 6, 'Лестница', 86.5, 50, '', NULL, true),
(200004, 2, 1, 3, '1', 71.5, 53.5, '', NULL, true),
(200003, 2, 1, 3, '6', 43, 10.38, '', NULL, true),
(200002, 2, 1, 3, '2', 67, 35.5, '', NULL, true),
(200001, 2, 1, 6, 'Лестница', 43, 6.75, '', NULL, true),
(201061, 2, 2, 1, 'Аудитория 207(2)', 69.5, 5.39, '', NULL, true)
ON CONFLICT (id) DO NOTHING;


-- РЁБРА
INSERT INTO edges (id, from_point_id, to_point_id, distance_meters, direction_text, floor_transition) VALUES 
(2000001, 200009, 200010, 3.19, '', false),
(2000002, 200011, 200010, 0.92, '', false),
(2000003, 200007, 200010, 2.61, '', false),
(2000004, 200007, 200022, 1.14, '', false),
(2000005, 200012, 200007, 2.83, '', false),
(2000006, 200012, 200021, 1.14, '', false),
(2000007, 200012, 200013, 0.91, '', false),
(2000008, 200013, 200014, 1.36, '', false),
(2000009, 200014, 200008, 1.82, '', false),
(2000010, 200008, 200015, 1.14, '', false),
(2000011, 200008, 200016, 1.34, '', false),
(2000012, 200012, 200020, 2.51, '', false),
(2000013, 200018, 200020, 0.76, '', false),
(2000014, 200020, 200017, 0.66, '', false),
(2000015, 200020, 200006, 4.78, '', false),
(2000016, 200006, 200019, 0.78, '', false),
(2000017, 200026, 200006, 1.82, '', false),
(2000018, 200026, 200023, 0.78, '', false),
(2000019, 200027, 200026, 1.37, '', false),
(2000020, 200025, 200027, 0.76, '', false),
(2000021, 200028, 200024, 0.78, '', false),
(2000022, 200028, 200027, 0.91, '', false),
(2000023, 200029, 200028, 2.29, '', false),
(2000024, 200029, 200032, 1.02, '', false),
(2000025, 200030, 200029, 1.74, '', false),
(2000026, 200031, 200030, 0.95, '', false),
(2000027, 200004, 200029, 1.72, '', false),
(2000028, 200004, 200030, 1.53, '', false),
(2000029, 200004, 200035, 1.71, '', false),
(2000030, 200004, 200037, 2.04, '', false),
(2000031, 200005, 200037, 2.6, '', false),
(2000032, 200037, 200049, 5.18, '', false),
(2000033, 200037, 200038, 1.37, '', false),
(2000034, 200036, 200035, 2.28, '', false),
(2000035, 200036, 200034, 0.78, '', false),
(2000036, 200035, 200033, 0.78, '', false),
(2000037, 200036, 200039, 3.64, '', false),
(2000038, 200039, 200040, 0.61, '', false),
(2000039, 200039, 200002, 1.14, '', false),
(2000040, 200002, 200041, 1.37, '', false),
(2000041, 200041, 200042, 0.49, '', false),
(2000042, 200041, 200043, 5.24, '', false),
(2000043, 200043, 200044, 1.9, '', false),
(2000044, 200045, 200044, 1.07, '', false),
(2000045, 200045, 200046, 5.28, '', false),
(2000046, 200003, 200046, 2.09, '', false),
(2000047, 200003, 200001, 1.65, '', false),
(2000048, 200003, 200048, 1.03, '', false),
(2000049, 200003, 200047, 1.16, '', false)
ON CONFLICT (id) DO NOTHING;
-- Второй этаж
-- ТОЧКИ
INSERT INTO points (id, building_id, floor_id, type, name, x_coord, y_coord, description, panorama_id, is_active) VALUES 
(201060, 2, 2, 1, 'Аудитория 209(2)', 82, 6.5, '', NULL, true),
(201059, 2, 2, 1, 'Аудитория 208(2)', 78.5, 4.5, '', NULL, true),
(201058, 2, 2, 1, 'Аудитория 210(2)', 78.5, 8.5, '', NULL, true),
(201057, 2, 2, 3, '', 78.5, 6.5, '', NULL, true),
(201056, 2, 2, 3, '', 69.5, 6.5, '', NULL, true),
(201055, 2, 2, 3, '', 69.5, 9.9, '', NULL, true),
(201054, 2, 2, 1, 'Аудитория 211(2)', 59.5, 12, '', NULL, true),
(201053, 2, 2, 3, '', 59.5, 9.9, '', NULL, true),
(201052, 2, 2, 1, 'Аудитория 212/213(2)', 50.5, 12, '', NULL, true),
(201051, 2, 2, 1, 'Аудитория 206(2)', 50.5, 9, '', NULL, true),
(201050, 2, 2, 3, '', 50.5, 10, '', NULL, true),
(201049, 2, 2, 3, '', 48.8, 10, '', NULL, true),
(201048, 2, 2, 1, 'Аудитория 201(2)', 30, 12.33, '', NULL, true),
(201047, 2, 2, 1, 'Аудитория 204(2)', 26.5, 9.5, '', NULL, true),
(201046, 2, 2, 3, '', 30.5, 9.5, '', NULL, true),
(201045, 2, 2, 1, 'Аудитория 217(2)', 62.5, 35.8, '', NULL, true),
(201044, 2, 2, 3, '', 67, 35.8, '', NULL, true),
(201043, 2, 2, 1, 'Аудитория 216(2)', 62.5, 39.5, '', NULL, true),
(201042, 2, 2, 1, 'Аудитория 221(2)', 74, 37, '', NULL, true),
(201041, 2, 2, 1, 'Аудитория 222/223(2)', 79.5, 45.5, '', NULL, true),
(201040, 2, 2, 1, 'Аудитория 214/215(2)', 64, 44.5, '', NULL, true),
(201039, 2, 2, 3, '', 69.5, 44.5, '', NULL, true),
(201038, 2, 2, 3, '', 75, 45.5, '', NULL, true),
(201037, 2, 2, 1, 'Аудитория 231/232(2)', 74.68, 84.5, '', NULL, true),
(201036, 2, 2, 3, '', 76.7, 88, '', NULL, true),
(201035, 2, 2, 3, '', 74.68, 88, '', NULL, true),
(201034, 2, 2, 1, 'Аудитория 234/235(2)', 89.82, 93.2, '', NULL, true),
(201033, 2, 2, 1, 'Аудитория 236(2)', 85.2, 95, '', NULL, true),
(201032, 2, 2, 1, 'Аудитория 233(2)', 85.2, 92, '', NULL, true),
(201031, 2, 2, 3, '', 85.2, 93.2, '', NULL, true),
(201030, 2, 2, 3, '', 79.15, 93.2, '', NULL, true),
(201029, 2, 2, 1, 'Аудитория 237(2)', 76.7, 94.2, '', NULL, true),
(201028, 2, 2, 1, 'Аудитория 238(2)', 74.22, 92.2, '', NULL, true),
(201027, 2, 2, 1, 'Аудитория 230(2)', 66.7, 84.5, '', NULL, true),
(201026, 2, 2, 1, 'Аудитория 239(2)', 63.98, 90.5, '', NULL, true),
(201025, 2, 2, 3, '', 63.98, 88, '', NULL, true),
(201024, 2, 2, 1, 'Аудитория 229(2)', 54.12, 85, '', NULL, true),
(201023, 2, 2, 1, 'Аудитория 240(2)', 53.62, 93, '', NULL, true),
(201022, 2, 2, 1, 'Аудитория 228(2)', 41.5, 88.5, '', NULL, true),
(201021, 2, 2, 3, '', 45.3, 88.5, '', NULL, true),
(201020, 2, 2, 3, '', 35.7, 91.5, '', NULL, true),
(201019, 2, 2, 1, 'Аудитория 241(2)', 35.7, 93, '', NULL, true),
(201018, 2, 2, 3, '', 14.5, 91.5, '', NULL, true),
(201017, 2, 2, 1, 'Аудитория 245(2)', 14.5, 90, '', NULL, true),
(201016, 2, 2, 1, 'Аудитория 244(2)', 10, 92, '', NULL, true),
(201015, 2, 2, 1, 'Аудитория 243(2)', 14.5, 94, '', NULL, true),
(201014, 2, 2, 1, 'Аудитория 242(2)', 25.5, 93, '', NULL, true),
(201013, 2, 2, 3, '10', 76.7, 92.2, '', NULL, true),
(201012, 2, 2, 3, '9', 54.12, 88.5, '', NULL, true),
(201011, 2, 2, 6, 'Лестница', 45.3, 95, '', NULL, true),
(201010, 2, 2, 3, '8', 45.3, 91.5, '', NULL, true),
(201009, 2, 2, 3, '7', 25.5, 91.5, '', NULL, true),
(201008, 2, 2, 3, '6', 55, 9.9, '', NULL, true),
(201007, 2, 2, 6, 'Лестница', 43.8, 5.5, '', NULL, true),
(201006, 2, 2, 3, '5', 43.8, 9.9, '', NULL, true),
(201005, 2, 2, 3, '4', 33.16, 9.9, '', NULL, true),
(201004, 2, 2, 3, '3', 67, 39, '', NULL, true),
(201003, 2, 2, 3, '2', 75, 39.5, '', NULL, true),
(201002, 2, 2, 6, 'Лестница', 88, 51, '', NULL, true),
(201001, 2, 2, 3, '1', 75, 50.5, '', NULL, true),
(201062, 2, 2, 7, 'Главный вход во 2 корпус', 43.08, 51, '', NULL, true)
ON CONFLICT (id) DO NOTHING;
-- РЁБРА
INSERT INTO edges (id, from_point_id, to_point_id, distance_meters, direction_text, floor_transition) VALUES 
(2010001, 201015, 201018, 1.11, '', false),
(2010002, 201016, 201018, 1.17, '', false),
(2010003, 201017, 201018, 0.67, '', false),
(2010004, 201018, 201009, 2.81, '', false),
(2010005, 201014, 201009, 0.67, '', false),
(2010006, 201009, 201020, 2.61, '', false),
(2010007, 201019, 201020, 0.67, '', false),
(2010008, 201010, 201020, 2.45, '', false),
(2010009, 201011, 201010, 1.56, '', false),
(2010010, 201010, 201021, 1.33, '', false),
(2010011, 201022, 201021, 0.97, '', false),
(2010012, 201021, 201012, 2.25, '', false),
(2010013, 201024, 201012, 1.56, '', false),
(2010014, 201012, 201023, 2, '', false),
(2010015, 201012, 201025, 2.53, '', false),
(2010016, 201026, 201025, 1.11, '', false),
(2010017, 201027, 201025, 1.7, '', false),
(2010018, 201025, 201035, 2.74, '', false),
(2010019, 201037, 201035, 1.56, '', false),
(2010020, 201035, 201036, 0.52, '', false),
(2010021, 201036, 201013, 1.87, '', false),
(2010022, 201028, 201013, 0.63, '', false),
(2010023, 201029, 201013, 0.89, '', false),
(2010024, 201030, 201013, 0.77, '', false),
(2010025, 201031, 201030, 1.55, '', false),
(2010026, 201032, 201031, 0.53, '', false),
(2010027, 201033, 201031, 0.8, '', false),
(2010028, 201034, 201031, 1.18, '', false),
(2010029, 201001, 201002, 3.33, '', false),
(2010030, 201001, 201038, 2.22, '', false),
(2010031, 201041, 201038, 1.15, '', false),
(2010032, 201038, 201039, 1.47, '', false),
(2010033, 201040, 201039, 1.41, '', false),
(2010034, 201038, 201003, 2.67, '', false),
(2010035, 201042, 201003, 1.14, '', false),
(2010036, 201003, 201004, 2.06, '', false),
(2010037, 201004, 201043, 1.17, '', false),
(2010038, 201004, 201044, 1.42, '', false),
(2010039, 201045, 201044, 1.15, '', false),
(2010040, 201046, 201047, 1.02, '', false),
(2010041, 201046, 201048, 1.26, '', false),
(2010042, 201046, 201005, 0.7, '', false),
(2010043, 201005, 201006, 2.72, '', false),
(2010044, 201049, 201006, 1.28, '', false),
(2010045, 201049, 201050, 0.43, '', false),
(2010046, 201051, 201050, 0.44, '', false),
(2010047, 201050, 201052, 0.89, '', false),
(2010048, 201050, 201008, 1.15, '', false),
(2010049, 201008, 201053, 1.15, '', false),
(2010050, 201054, 201053, 0.93, '', false),
(2010051, 201053, 201055, 2.56, '', false),
(2010052, 201055, 201056, 1.51, '', false),
(2010053, 201056, 201057, 2.3, '', false),
(2010054, 201060, 201057, 0.89, '', false),
(2010055, 201059, 201057, 0.89, '', false),
(2010056, 201057, 201058, 0.89, '', false),
(2010057, 201061, 201056, 0.49, '', false),
(2010058, 201006, 201007, 1.96, '', false),
(2010059, 201062, 201001, 8.16, '', false)
ON CONFLICT (id) DO NOTHING;
-- Третий этаж
-- ТОЧКИ
INSERT INTO points (id, building_id, floor_id, type, name, x_coord, y_coord, description, panorama_id, is_active) VALUES 
(202064, 2, 3, 1, '', 59, 14.5, '', NULL, true),
(202063, 2, 3, 1, 'Аудитория 312(2)', 59, 17.93, '', NULL, true),
(202062, 2, 3, 1, 'Аудитория 304/305(2)', 19, 10, '', NULL, true),
(202061, 2, 3, 1, 'Аудитория 306(2)', 26, 7.5, '', NULL, true),
(202060, 2, 3, 1, 'Аудитория 302/303(2)', 25, 12.5, '', NULL, true),
(202059, 2, 3, 1, 'Аудитория 307(2)', 35, 12.5, '', NULL, true),
(202058, 2, 3, 3, '', 35, 10, '', NULL, true),
(202057, 2, 3, 1, 'Аудитория 308(2)', 52.15, 9, '', NULL, true),
(202056, 2, 3, 3, '', 50.73, 11, '', NULL, true),
(202055, 2, 3, 3, '', 50.73, 14.5, '', NULL, true),
(202054, 2, 3, 1, 'Аудитория 309(2)', 62.03, 11, '', NULL, true),
(202053, 2, 3, 3, '', 62.03, 14.5, '', NULL, true),
(202052, 2, 3, 1, 'Аудитория 310(2)', 79.5, 7.5, '', NULL, true),
(202051, 2, 3, 3, '', 73.5, 7.5, '', NULL, true),
(202050, 2, 3, 1, 'Аудитория 311(2)', 79.5, 14.5, '', NULL, true),
(202049, 2, 3, 1, 'Аудитория 313(2)', 67, 20, '', NULL, true),
(202048, 2, 3, 3, '', 74.5, 20, '', NULL, true),
(202047, 2, 3, 1, 'Аудитория 314(2)', 67, 26.5, '', NULL, true),
(202046, 2, 3, 3, '', 74.5, 26.5, '', NULL, true),
(202045, 2, 3, 1, 'Аудитория 316(2)', 65, 40, '', NULL, true),
(202044, 2, 3, 1, 'Аудитория 315(2)', 61.5, 37.2, '', NULL, true),
(202043, 2, 3, 3, '', 65, 37.2, '', NULL, true),
(202042, 2, 3, 3, '', 74.5, 37.2, '', NULL, true),
(202041, 2, 3, 1, 'Аудитория 317(2)', 79.5, 45.5, '', NULL, true),
(202040, 2, 3, 3, '', 74.5, 45.5, '', NULL, true),
(202039, 2, 3, 1, 'Аудитория 319(2)', 79.5, 57, '', NULL, true),
(202038, 2, 3, 3, '', 74.5, 57, '', NULL, true),
(202037, 2, 3, 1, 'Аудитория 321/322(2)', 62.5, 72.3, '', NULL, true),
(202036, 2, 3, 3, '', 66.5, 72.3, '', NULL, true),
(202035, 2, 3, 1, 'Аудитория 325(2)', 66.5, 65.5, '', NULL, true),
(202034, 2, 3, 3, '', 66.5, 69.3, '', NULL, true),
(202033, 2, 3, 3, '', 74.5, 69.3, '', NULL, true),
(202032, 2, 3, 1, 'Аудитория 323(2)', 68, 80.3, '', NULL, true),
(202031, 2, 3, 3, '', 74.5, 80.3, '', NULL, true),
(202030, 2, 3, 3, '', 74.5, 83.3, '', NULL, true),
(202029, 2, 3, 1, 'Аудитория 324(2)', 68, 83.3, '', NULL, true),
(202028, 2, 3, 1, 'Аудитория 325(2)', 79.2, 87.5, '', NULL, true),
(202027, 2, 3, 1, 'Аудитория 326(2)', 73.5, 91, '', NULL, true),
(202026, 2, 3, 3, '', 73.5, 88.9, '', NULL, true),
(202025, 2, 3, 1, 'Аудитория 329/330/331(2)', 47, 87.5, '', NULL, true),
(202024, 2, 3, 3, '', 52.7, 88.9, '', NULL, true),
(202023, 2, 3, 1, 'Аудитория 327(2)', 57.5, 91.5, '', NULL, true),
(202022, 2, 3, 1, 'Аудитория 328(2)', 52.7, 93.5, '', NULL, true),
(202021, 2, 3, 3, '', 52.7, 91.5, '', NULL, true),
(202020, 2, 3, 1, 'Аудитория 338/339(2)', 36.2, 89.5, '', NULL, true),
(202019, 2, 3, 3, '', 36.2, 91.3, '', NULL, true),
(202018, 2, 3, 1, 'Аудитория 332/333(2)', 27, 92.5, '', NULL, true),
(202017, 2, 3, 3, '', 27, 91.3, '', NULL, true),
(202016, 2, 3, 3, '', 23, 91.3, '', NULL, true),
(202015, 2, 3, 1, 'Аудитория 337(2)', 17.5, 89.5, '', NULL, true),
(202014, 2, 3, 1, 'Аудитория 334(2)', 17.5, 94, '', NULL, true),
(202013, 2, 3, 1, 'Аудитория 335(2)', 12.5, 93, '', NULL, true),
(202012, 2, 3, 1, 'Аудитория 336(2)', 12.5, 90.5, '', NULL, true),
(202011, 2, 3, 6, 'Лестница', 45.19, 95.5, '', NULL, true),
(202010, 2, 3, 3, '7', 17.5, 91.5, '', NULL, true),
(202009, 2, 3, 3, '6', 44.69, 91.5, '', NULL, true),
(202008, 2, 3, 3, '5', 74.5, 87.5, '', NULL, true),
(202007, 2, 3, 3, '4', 26, 10, '', NULL, true),
(202006, 2, 3, 6, 'Лестница', 43.5, 4.5, '', NULL, true),
(202005, 2, 3, 3, '3', 43.5, 10, '', NULL, true),
(202004, 2, 3, 3, '2', 73.5, 14.5, '', NULL, true),
(202003, 2, 3, 6, 'Лестница', 88, 51, '', NULL, true),
(202002, 2, 3, 3, '1', 73, 50.5, '', NULL, true),
(202001, 2, 3, 1, 'Музей истории ПГНИУ', 62.5, 50.5, '', NULL, true),
(202065, 2, 3, 7, 'Переход в корпуса 1,16', 73.5, 1, '', NULL, true)
ON CONFLICT (id) DO NOTHING;
-- РЁБРА
INSERT INTO edges (id, from_point_id, to_point_id, distance_meters, direction_text, floor_transition) VALUES 
(2020001, 202010, 202014, 1.11, '', false),
(2020002, 202010, 202013, 1.44, '', false),
(2020003, 202010, 202012, 1.35, '', false),
(2020004, 202010, 202015, 0.89, '', false),
(2020005, 202010, 202016, 1.41, '', false),
(2020006, 202016, 202017, 1.02, '', false),
(2020007, 202018, 202017, 0.53, '', false),
(2020008, 202017, 202019, 2.35, '', false),
(2020009, 202019, 202020, 0.8, '', false),
(2020010, 202019, 202009, 2.17, '', false),
(2020011, 202011, 202009, 1.78, '', false),
(2020012, 202009, 202021, 2.05, '', false),
(2020013, 202021, 202022, 0.89, '', false),
(2020014, 202021, 202023, 1.23, '', false),
(2020015, 202024, 202021, 1.16, '', false),
(2020016, 202025, 202024, 1.58, '', false),
(2020017, 202024, 202026, 5.32, '', false),
(2020018, 202027, 202026, 0.93, '', false),
(2020019, 202008, 202028, 1.2, '', false),
(2020020, 202008, 202030, 1.87, '', false),
(2020021, 202029, 202030, 1.66, '', false),
(2020022, 202031, 202030, 1.33, '', false),
(2020023, 202032, 202031, 1.66, '', false),
(2020024, 202031, 202033, 4.89, '', false),
(2020025, 202033, 202034, 2.04, '', false),
(2020026, 202035, 202034, 1.69, '', false),
(2020027, 202034, 202036, 1.33, '', false),
(2020028, 202037, 202036, 1.02, '', false),
(2020029, 202033, 202038, 5.47, '', false),
(2020030, 202038, 202039, 1.28, '', false),
(2020031, 202038, 202002, 2.92, '', false),
(2020032, 202003, 202002, 3.84, '', false),
(2020033, 202001, 202002, 2.68, '', false),
(2020034, 202002, 202040, 2.26, '', false),
(2020035, 202040, 202041, 1.28, '', false),
(2020036, 202042, 202040, 3.69, '', false),
(2020037, 202043, 202042, 2.43, '', false),
(2020038, 202043, 202044, 0.89, '', false),
(2020039, 202045, 202043, 1.24, '', false),
(2020040, 202042, 202046, 4.76, '', false),
(2020041, 202046, 202047, 1.92, '', false),
(2020042, 202046, 202048, 2.89, '', false),
(2020043, 202049, 202048, 1.92, '', false),
(2020044, 202048, 202004, 2.46, '', false),
(2020045, 202050, 202004, 1.53, '', false),
(2020046, 202004, 202051, 3.11, '', false),
(2020047, 202052, 202051, 1.53, '', false),
(2020048, 202065, 202051, 2.89, '', false),
(2020049, 202004, 202053, 2.93, '', false),
(2020050, 202054, 202053, 1.56, '', false),
(2020051, 202064, 202053, 0.77, '', false),
(2020052, 202063, 202064, 1.53, '', false),
(2020053, 202055, 202064, 2.11, '', false),
(2020054, 202055, 202056, 1.56, '', false),
(2020055, 202057, 202056, 0.96, '', false),
(2020056, 202056, 202005, 1.9, '', false),
(2020057, 202006, 202005, 2.45, '', false),
(2020058, 202005, 202058, 2.17, '', false),
(2020059, 202059, 202058, 1.11, '', false),
(2020060, 202058, 202007, 2.3, '', false),
(2020061, 202061, 202007, 1.11, '', false),
(2020062, 202062, 202007, 1.79, '', false),
(2020063, 202060, 202007, 1.14, '', false),
(2020064, 202026, 202008, 0.67, '', false)
ON CONFLICT (id) DO NOTHING;

-- Третий этаж
-- ТОЧКИ
INSERT INTO points (id, building_id, floor_id, type, name, x_coord, y_coord, description, panorama_id, is_active) VALUES 
(203059, 2, 4, 1, 'Аудитория 409(2)', 76, 4.5, '', NULL, true),
(203058, 2, 4, 1, 'Аудитория 410(2)', 72, 8.5, '', NULL, true),
(203057, 2, 4, 3, '', 76, 8.5, '', NULL, true),
(203056, 2, 4, 1, 'Аудитория 411(2)', 79.5, 13.8, '', NULL, true),
(203055, 2, 4, 3, '', 76, 14, '', NULL, true),
(203054, 2, 4, 1, 'Аудитория 412(2)', 71.5, 17.5, '', NULL, true),
(203053, 2, 4, 3, '', 71.5, 14, '', NULL, true),
(203052, 2, 4, 1, 'Аудитория 413(2)', 58, 17.5, '', NULL, true),
(203051, 2, 4, 3, '', 58, 13.8, '', NULL, true),
(203050, 2, 4, 1, 'Аудитория 414(2)', 47, 13.8, '', NULL, true),
(203049, 2, 4, 3, '', 50.5, 13.8, '', NULL, true),
(203048, 2, 4, 3, '', 50.5, 10.5, '', NULL, true),
(203047, 2, 4, 1, 'Аудитория 408(2)', 52.5, 8.23, '', NULL, true),
(203046, 2, 4, 1, 'Аудитория 401(2)', 13.5, 13, '', NULL, true),
(203045, 2, 4, 1, 'Аудитория 402(2)', 9, 10.18, '', NULL, true),
(203044, 2, 4, 1, 'Аудитория 403/404(2)', 14, 7, '', NULL, true),
(203043, 2, 4, 1, 'Аудитория 406/407(2)', 35.5, 9, '', NULL, true),
(203042, 2, 4, 3, '', 35.5, 10, '', NULL, true),
(203041, 2, 4, 3, '', 65.5, 45.5, '', NULL, true),
(203040, 2, 4, 1, 'Аудитория 416/417/418/419(2)', 65.5, 42.5, '', NULL, true),
(203039, 2, 4, 1, 'Аудитория 421(2)', 79.5, 45.5, '', NULL, true),
(203038, 2, 4, 1, 'Аудитория 410(2)', 73, 42.5, '', NULL, true),
(203037, 2, 4, 3, '', 73, 45.5, '', NULL, true),
(203036, 2, 4, 1, 'Аудитория 415(2)', 61.81, 50.5, '', NULL, true),
(203035, 2, 4, 1, 'Аудитория 420(2)', 89.08, 57.1, '', NULL, true),
(203034, 2, 4, 3, '', 73.7, 57.1, '', NULL, true),
(203033, 2, 4, 1, 'Аудитория 424(2)', 67.5, 64.5, '', NULL, true),
(203032, 2, 4, 3, '', 73.7, 64.5, '', NULL, true),
(203031, 2, 4, 1, 'Аудитория 425(2)', 67.5, 74.7, '', NULL, true),
(203030, 2, 4, 3, '', 73.7, 74.7, '', NULL, true),
(203029, 2, 4, 1, 'Аудитория 426(2)', 67.5, 82.3, '', NULL, true),
(203028, 2, 4, 3, '', 73.7, 82.3, '', NULL, true),
(203027, 2, 4, 1, 'Аудитория 427/428/429(2)', 78.5, 87.5, '', NULL, true),
(203026, 2, 4, 1, 'Аудитория 430(2)', 73.2, 91.5, '', NULL, true),
(203025, 2, 4, 1, 'Аудитория 431(2)', 62.7, 91.5, '', NULL, true),
(203024, 2, 4, 3, '', 62.7, 87.5, '', NULL, true),
(203023, 2, 4, 1, 'Аудитория 432(2)', 53, 91.5, '', NULL, true),
(203022, 2, 4, 3, '', 53, 87.5, '', NULL, true),
(203021, 2, 4, 1, 'Аудитория 433/434(2)', 41, 87.5, '', NULL, true),
(203020, 2, 4, 1, 'Аудитория 435(2)', 36.5, 94, '', NULL, true),
(203019, 2, 4, 3, '', 36.5, 92, '', NULL, true),
(203018, 2, 4, 1, 'Аудитория 436(2)', 27, 94, '', NULL, true),
(203017, 2, 4, 3, '', 27, 92, '', NULL, true),
(203016, 2, 4, 1, 'Аудитория 437(2)', 17.5, 94, '', NULL, true),
(203015, 2, 4, 1, 'Аудитория 440(2)', 17.5, 90, '', NULL, true),
(203014, 2, 4, 1, 'Аудитория 438(2)', 12.5, 93, '', NULL, true),
(203013, 2, 4, 1, 'Аудитория 439(2)', 12.5, 90.5, '', NULL, true),
(203012, 2, 4, 3, '9', 17.5, 92, '', NULL, true),
(203011, 2, 4, 6, 'Лестница', 45.85, 96, '', NULL, true),
(203010, 2, 4, 3, '8', 45.85, 92, '', NULL, true),
(203009, 2, 4, 3, '7', 45.85, 87.5, '', NULL, true),
(203008, 2, 4, 3, '6', 73.7, 87.5, '', NULL, true),
(203007, 2, 4, 3, '4', 23.5, 9.68, '', NULL, true),
(203006, 2, 4, 3, '5', 14, 9.68, '', NULL, true),
(203005, 2, 4, 6, 'Лестница', 43.37, 4.15, '', NULL, true),
(203004, 2, 4, 3, '3', 43.37, 9.73, '', NULL, true),
(203003, 2, 4, 3, '2', 64.75, 14, '', NULL, true),
(203002, 2, 4, 6, 'Лестница', 87.9, 50.5, '', NULL, true),
(203001, 2, 4, 3, '1', 73, 50.5, '', NULL, true)
ON CONFLICT (id) DO NOTHING;


-- РЁБРА
INSERT INTO edges (id, from_point_id, to_point_id, distance_meters, direction_text, floor_transition) VALUES 
(2030001, 203014, 203012, 1.35, '', false),
(2030002, 203013, 203012, 1.44, '', false),
(2030003, 203015, 203012, 0.89, '', false),
(2030004, 203016, 203012, 0.89, '', false),
(2030005, 203012, 203017, 2.43, '', false),
(2030006, 203018, 203017, 0.89, '', false),
(2030007, 203019, 203017, 2.43, '', false),
(2030008, 203020, 203019, 0.89, '', false),
(2030009, 203019, 203010, 2.39, '', false),
(2030010, 203011, 203010, 1.78, '', false),
(2030011, 203023, 203010, 1.84, '', false),
(2030012, 203009, 203010, 2, '', false),
(2030013, 203021, 203009, 1.24, '', false),
(2030014, 203022, 203009, 1.83, '', false),
(2030015, 203022, 203023, 1.78, '', false),
(2030016, 203022, 203024, 2.48, '', false),
(2030017, 203024, 203025, 1.78, '', false),
(2030018, 203008, 203024, 2.81, '', false),
(2030019, 203008, 203026, 1.78, '', false),
(2030020, 203008, 203027, 1.23, '', false),
(2030021, 203008, 203028, 2.31, '', false),
(2030022, 203029, 203028, 1.58, '', false),
(2030023, 203030, 203028, 3.38, '', false),
(2030024, 203031, 203030, 1.58, '', false),
(2030025, 203032, 203030, 4.54, '', false),
(2030026, 203033, 203032, 1.58, '', false),
(2030027, 203034, 203032, 3.29, '', false),
(2030028, 203034, 203035, 3.93, '', false),
(2030029, 203001, 203034, 2.94, '', false),
(2030030, 203002, 203001, 3.81, '', false),
(2030031, 203036, 203001, 2.86, '', false),
(2030032, 203001, 203037, 2.22, '', false),
(2030033, 203041, 203037, 1.92, '', false),
(2030034, 203039, 203037, 1.66, '', false),
(2030035, 203038, 203037, 1.33, '', false),
(2030036, 203040, 203041, 1.33, '', false),
(2030037, 203005, 203004, 2.48, '', false),
(2030038, 203004, 203048, 1.85, '', false),
(2030039, 203047, 203048, 1.13, '', false),
(2030040, 203049, 203048, 1.47, '', false),
(2030041, 203049, 203050, 0.89, '', false),
(2030042, 203049, 203051, 1.92, '', false),
(2030043, 203051, 203052, 1.65, '', false),
(2030044, 203051, 203003, 1.73, '', false),
(2030045, 203053, 203003, 1.73, '', false),
(2030046, 203054, 203053, 1.56, '', false),
(2030047, 203053, 203055, 1.15, '', false),
(2030048, 203055, 203056, 0.9, '', false),
(2030049, 203057, 203055, 2.45, '', false),
(2030050, 203058, 203057, 1.02, '', false),
(2030051, 203059, 203057, 1.78, '', false),
(2030052, 203042, 203004, 2.02, '', false),
(2030053, 203042, 203043, 0.44, '', false),
(2030054, 203042, 203007, 3.07, '', false),
(2030055, 203007, 203006, 2.43, '', false),
(2030056, 203044, 203006, 1.19, '', false),
(2030057, 203045, 203006, 1.3, '', false),
(2030058, 203046, 203006, 1.48, '', false)
ON CONFLICT (id) DO NOTHING;
--Четвертый этаж
-- ТОЧКИ
INSERT INTO points (id, building_id, floor_id, type, name, x_coord, y_coord, description, panorama_id, is_active) VALUES 
(204042, 2, 5, 1, 'Аудитория 501/502(2)', 24, 14.55, '', NULL, true),
(204041, 2, 5, 1, 'Аудитория 503(2)', 35.5, 12.7, '', NULL, true),
(204040, 2, 5, 3, '', 35.5, 14.55, '', NULL, true),
(204039, 2, 5, 3, '', 47.5, 14.55, '', NULL, true),
(204038, 2, 5, 3, '', 50.5, 15.55, '', NULL, true),
(204037, 2, 5, 3, '', 53.2, 15.55, '', NULL, true),
(204036, 2, 5, 3, '', 56.91, 15.55, '', NULL, true),
(204035, 2, 5, 1, 'Аудитория 508/509(2)', 53.2, 18, '', NULL, true),
(204034, 2, 5, 1, 'Аудитория 504(2)', 50.5, 12.7, '', NULL, true),
(204033, 2, 5, 1, 'Аудитория 505(2)', 56.91, 12.7, '', NULL, true),
(204032, 2, 5, 1, 'Аудитория 506(2)', 64.7, 12.7, '', NULL, true),
(204031, 2, 5, 1, 'Аудитория 507(2)', 70.5, 14, '', NULL, true),
(204030, 2, 5, 3, '', 67.3, 15.55, '', NULL, true),
(204029, 2, 5, 3, '', 67.3, 20.5, '', NULL, true),
(204028, 2, 5, 1, 'Аудитория 517(2)', 67.3, 43, '', NULL, true),
(204027, 2, 5, 1, 'Аудитория 515/516(2)', 60, 47, '', NULL, true),
(204026, 2, 5, 1, 'Аудитория 518(2)', 77.5, 46, '', NULL, true),
(204025, 2, 5, 3, '', 67.5, 46.5, '', NULL, true),
(204023, 2, 5, 1, 'Аудитория 510(2)', 78.25, 57, '', NULL, true),
(204021, 2, 5, 3, '3', 64.7, 15.55, '', NULL, true),
(204020, 2, 5, 3, '5', 28, 14.55, '', NULL, true),
(204019, 2, 5, 3, '4', 44.5, 14.55, '', NULL, true),
(204018, 2, 5, 6, 'Лестница', 44.5, 7, '', NULL, true),
(204017, 2, 5, 6, 'Лестница', 85, 51.5, '', NULL, true),
(204016, 2, 5, 3, '1', 69.5, 51.5, '', NULL, true),
(204015, 2, 5, 3, '', 61.5, 57.5, '', NULL, true),
(204014, 2, 5, 3, '', 61.5, 60, '', NULL, true),
(204013, 2, 5, 1, 'Аудитория 511(2)', 63.5, 62, '', NULL, true),
(204012, 2, 5, 1, 'Аудитория 513/514(2)', 57, 62, '', NULL, true),
(204011, 2, 5, 3, '2', 60, 62, '', NULL, true),
(204010, 2, 5, 1, 'Аудитория 512(2)', 60, 67.5, '', NULL, true),
(204009, 2, 5, 1, 'Аудитория 522(2)', 56.23, 88.5, '', NULL, true),
(204008, 2, 5, 1, 'Аудитория 519(2)', 56.23, 81.5, '', NULL, true),
(204007, 2, 5, 3, '', 66.5, 68.5, '', NULL, true),
(204006, 2, 5, 3, '', 66.5, 84, '', NULL, true),
(204005, 2, 5, 3, '6', 68, 86.5, '', NULL, true),
(204004, 2, 5, 3, '', 64.83, 86.5, '', NULL, true),
(204003, 2, 5, 3, '7', 56.23, 85.5, '', NULL, true),
(204002, 2, 5, 3, '8', 43.5, 85.5, '', NULL, true),
(204001, 2, 5, 6, 'Лестница', 44, 93.7, '', NULL, true),
(204044, 2, 5, 1, 'Аудитория 520(2)', 73, 86.5, '', NULL, true),
(204043, 2, 5, 1, 'Аудитория 521(2)', 68, 88.5, '', NULL, true)
ON CONFLICT (id) DO NOTHING;


-- РЁБРА
INSERT INTO edges (id, from_point_id, to_point_id, distance_meters, direction_text, floor_transition) VALUES 
(2040001, 204001, 204002, 3.84, '', false),
(2040002, 204002, 204003, 3.45, '', false),
(2040003, 204009, 204003, 1.4, '', false),
(2040004, 204008, 204003, 1.87, '', false),
(2040005, 204003, 204004, 2.37, '', false),
(2040006, 204004, 204005, 0.86, '', false),
(2040007, 204043, 204005, 0.94, '', false),
(2040008, 204005, 204044, 1.35, '', false),
(2040009, 204004, 204006, 1.25, '', false),
(2040010, 204005, 204006, 1.24, '', false),
(2040011, 204006, 204007, 7.26, '', false),
(2040012, 204010, 204007, 1.82, '', false),
(2040013, 204011, 204010, 2.58, '', false),
(2040014, 204012, 204011, 0.81, '', false),
(2040015, 204011, 204013, 0.95, '', false),
(2040016, 204011, 204014, 1.02, '', false),
(2040017, 204014, 204015, 1.17, '', false),
(2040018, 204015, 204023, 4.54, '', false),
(2040019, 204015, 204016, 3.55, '', false),
(2040020, 204016, 204023, 3.5, '', false),
(2040021, 204017, 204016, 4.2, '', false),
(2040022, 204025, 204016, 2.4, '', false),
(2040023, 204025, 204027, 2.04, '', false),
(2040024, 204026, 204025, 2.72, '', false),
(2040025, 204028, 204025, 1.64, '', false),
(2040026, 204028, 204029, 10.54, '', false),
(2040027, 204029, 204030, 2.32, '', false),
(2040028, 204031, 204030, 1.13, '', false),
(2040029, 204021, 204030, 0.7, '', false),
(2040030, 204032, 204021, 1.33, '', false),
(2040031, 204021, 204036, 2.11, '', false),
(2040032, 204033, 204036, 1.33, '', false),
(2040033, 204036, 204037, 1, '', false),
(2040034, 204035, 204037, 1.15, '', false),
(2040035, 204038, 204039, 0.94, '', false),
(2040036, 204037, 204038, 0.73, '', false),
(2040037, 204034, 204038, 1.33, '', false),
(2040038, 204039, 204019, 0.81, '', false),
(2040039, 204019, 204018, 3.54, '', false),
(2040040, 204019, 204040, 2.44, '', false),
(2040041, 204041, 204040, 0.87, '', false),
(2040042, 204040, 204020, 2.03, '', false),
(2040043, 204042, 204020, 1.08, '', false)
ON CONFLICT (id) DO NOTHING;
-- ЛЕСТНИЦЫ
INSERT INTO edges (id, from_point_id, to_point_id, distance_meters, direction_text, floor_transition) VALUES 
(2010059, 200005, 201002, 7, '', true),
(2020065, 201002, 202003, 7, '', true),
(2030066, 202003, 203002, 7, '', true),
(2040067, 203002, 204017, 7, '', true),
(2010068, 200001, 201007, 7, '', true),
(2020069, 201007, 202006, 7, '', true),
(2030070, 202006, 203005, 7, '', true),
(2040071, 203005, 204018, 7, '', true),
(2010072, 200009, 201011, 7, '', true),
(2020073, 201011, 202011, 7, '', true),
(2030074, 202011, 203011, 7, '', true),
(2040075, 203011, 204001, 7, '', true),
-- Переход в 1 корпус
(2020067, 11289, 202065, 15, 'Переход в корпус 2', true),
(2020068, 202065, 11289, 15, 'Переход в корпус 1', true)
ON CONFLICT (id) DO NOTHING;

-- ПАНОРАМЫ
INSERT INTO panoramas (id, point_id, image_path, title, description, yaw, pitch) VALUES 
(2990002, 200001, '/panoramas/2.1.л2.jpg', 'Лестница', '', 0, 0),
(2990003, 200002, '/panoramas/2.1.2.jpg', 'Коридор', '', 0, 0),
(2990004, 200004, '/panoramas/2.1.1.jpg', 'Центральный проход', '', 0, 0),
(2990005, 200005, '/panoramas/2.1.л1.jpg', 'Центральная лестница', '', 0, 0),
(2990006, 200006, '/panoramas/2.1.3.jpg', 'Коридор', '', 0, 0),
(2990007, 200008, '/panoramas/2.1.5.jpg', 'Развилка', '', 0, 0),
(2990008, 200007, '/panoramas/2.1.4.jpg', 'Коридор', '', 0, 0),
(2990009, 200009, '/panoramas/2.1.л3.jpg', 'Лестница', '', 0, 0),
(2990015, 200003, '/panoramas/2.1.6.jpg', 'У лестницы', '', 0, 0)
ON CONFLICT (id) DO NOTHING;

-- ОБНОВЛЕНИЕ ТОЧЕК (установка panorama_id)
UPDATE points SET panorama_id = 2990002 WHERE id = 200001;
UPDATE points SET panorama_id = 2990003 WHERE id = 200002;
UPDATE points SET panorama_id = 2990004 WHERE id = 200004;
UPDATE points SET panorama_id = 2990005 WHERE id = 200005;
UPDATE points SET panorama_id = 2990006 WHERE id = 200006;
UPDATE points SET panorama_id = 2990007 WHERE id = 200008;
UPDATE points SET panorama_id = 2990008 WHERE id = 200007;
UPDATE points SET panorama_id = 2990009 WHERE id = 200009;
UPDATE points SET panorama_id = 2990015 WHERE id = 200003;

-- ПАНОРАМЫ
INSERT INTO panoramas (id, point_id, image_path, title, description, yaw, pitch) VALUES 
(2990010, 201001, '/panoramas/2.2.1.jpg', 'Холл ИКНТ', '', 0, 0),
(2990012, 201003, '/panoramas/2.2.2.jpg', 'Коридор', '', 0, 0),
(2990013, 201002, '/panoramas/2.2.л1.jpg', 'Главная лестница', '', 0, 0),
(2990014, 201004, '/panoramas/2.2.3.jpg', 'Коридор', '', 0, 0),
(2990016, 201005, '/panoramas/2.2.4.jpg', 'Коридор', '', 0, 0),
(2990017, 201006, '/panoramas/2.2.5.jpg', 'Развилка', '', 0, 0),
(2990018, 201011, '/panoramas/2.2.л3.jpg', 'Лестница', '', 0, 0),
(2990019, 201008, '/panoramas/2.2.6.jpg', 'Коридор', '', 0, 0),
(2990020, 201007, '/panoramas/2.2.л2.jpg', 'Лестница', '', 0, 0),
(2990021, 201009, '/panoramas/2.2.7.jpg', 'Коридор', '', 0, 0),
(2990022, 201010, '/panoramas/2.2.8.jpg', 'У лестницы', '', 0, 0),
(2990023, 201012, '/panoramas/2.2.8.jpg', 'Коридор', '', 0, 0),
(2990024, 201013, '/panoramas/2.2.10.jpg', 'Развилка', '', 0, 0)
ON CONFLICT (id) DO NOTHING;

-- ОБНОВЛЕНИЕ ТОЧЕК (установка panorama_id)
UPDATE points SET panorama_id = 2990010 WHERE id = 201001;
UPDATE points SET panorama_id = 2990012 WHERE id = 201003;
UPDATE points SET panorama_id = 2990013 WHERE id = 201002;
UPDATE points SET panorama_id = 2990014 WHERE id = 201004;
UPDATE points SET panorama_id = 2990016 WHERE id = 201005;
UPDATE points SET panorama_id = 2990017 WHERE id = 201006;
UPDATE points SET panorama_id = 2990018 WHERE id = 201011;
UPDATE points SET panorama_id = 2990019 WHERE id = 201008;
UPDATE points SET panorama_id = 2990020 WHERE id = 201007;
UPDATE points SET panorama_id = 2990021 WHERE id = 201009;
UPDATE points SET panorama_id = 2990022 WHERE id = 201010;
UPDATE points SET panorama_id = 2990023 WHERE id = 201012;
UPDATE points SET panorama_id = 2990024 WHERE id = 201013;

-- ПАНОРАМЫ
INSERT INTO panoramas (id, point_id, image_path, title, description, yaw, pitch) VALUES 
(2990025, 202002, '/panoramas/2.3.1.jpg', 'Холл', '', 0, 0),
(2990026, 202004, '/panoramas/2.3.2.jpg', 'Поворот', '', 0, 0),
(2990027, 202005, '/panoramas/2.3.3.jpg', 'Поворот', '', 0, 0),
(2990028, 202007, '/panoramas/2.3.4.jpg', 'Коридор', '', 0, 0),
(2990029, 202008, '/panoramas/2.3.5.jpg', 'Коридор', '', 0, 0),
(2990030, 202009, '/panoramas/2.3.6.jpg', 'Коридор', '', 0, 0),
(2990031, 202010, '/panoramas/2.3.7.jpg', 'Коридор', '', 0, 0),
(2990032, 202011, '/panoramas/2.3.л3.jpg', 'Лестница', '', 0, 0),
(2990033, 202003, '/panoramas/2.3.л1.jpg', 'Главная лестница', '', 0, 0),
(2990034, 202006, '/panoramas/2.3.л2.jpg', 'Лестница', '', 0, 0)
ON CONFLICT (id) DO NOTHING;

-- ОБНОВЛЕНИЕ ТОЧЕК (установка panorama_id)
UPDATE points SET panorama_id = 2990025 WHERE id = 202002;
UPDATE points SET panorama_id = 2990026 WHERE id = 202004;
UPDATE points SET panorama_id = 2990027 WHERE id = 202005;
UPDATE points SET panorama_id = 2990028 WHERE id = 202007;
UPDATE points SET panorama_id = 2990029 WHERE id = 202008;
UPDATE points SET panorama_id = 2990030 WHERE id = 202009;
UPDATE points SET panorama_id = 2990031 WHERE id = 202010;
UPDATE points SET panorama_id = 2990032 WHERE id = 202011;
UPDATE points SET panorama_id = 2990033 WHERE id = 202003;
UPDATE points SET panorama_id = 2990034 WHERE id = 202006;

-- ПАНОРАМЫ
INSERT INTO panoramas (id, point_id, image_path, title, description, yaw, pitch) VALUES 
(2990035, 203001, '/panoramas/2.4.1.jpg', 'Холл', '', 0, 0),
(2990036, 203003, '/panoramas/2.4.2.jpg', 'Коридор', '', 0, 0),
(2990037, 203004, '/panoramas/2.4.3.jpg', 'Коридор', '', 0, 0),
(2990038, 203007, '/panoramas/2.4.4.jpg', 'Коридор', '', 0, 0),
(2990039, 203006, '/panoramas/2.4.5.jpg', 'Тупик', '', 0, 0),
(2990040, 203008, '/panoramas/2.4.6.jpg', 'Поворот', '', 0, 0),
(2990041, 203009, '/panoramas/2.4.7.jpg', 'Коридор', '', 0, 0),
(2990042, 203010, '/panoramas/2.4.8.jpg', 'Коридор', '', 0, 0),
(2990043, 203012, '/panoramas/2.4.9.jpg', 'Тупик', '', 0, 0),
(2990044, 203011, '/panoramas/2.4.л3.jpg', 'Лестница', '', 0, 0),
(2990045, 203002, '/panoramas/2.4.л1.jpg', 'Главная лестница', '', 0, 0),
(2990046, 203005, '/panoramas/2.4.л2.jpg', 'Лестница', '', 0, 0)
ON CONFLICT (id) DO NOTHING;

-- ОБНОВЛЕНИЕ ТОЧЕК (установка panorama_id)
UPDATE points SET panorama_id = 2990035 WHERE id = 203001;
UPDATE points SET panorama_id = 2990036 WHERE id = 203003;
UPDATE points SET panorama_id = 2990037 WHERE id = 203004;
UPDATE points SET panorama_id = 2990038 WHERE id = 203007;
UPDATE points SET panorama_id = 2990039 WHERE id = 203006;
UPDATE points SET panorama_id = 2990040 WHERE id = 203008;
UPDATE points SET panorama_id = 2990041 WHERE id = 203009;
UPDATE points SET panorama_id = 2990042 WHERE id = 203010;
UPDATE points SET panorama_id = 2990043 WHERE id = 203012;
UPDATE points SET panorama_id = 2990044 WHERE id = 203011;
UPDATE points SET panorama_id = 2990045 WHERE id = 203002;
UPDATE points SET panorama_id = 2990046 WHERE id = 203005;



-- ПАНОРАМЫ
INSERT INTO panoramas (id, point_id, image_path, title, description, yaw, pitch) VALUES 
(2990047, 204016, '/panoramas/2.5.1.jpg', 'Холл', '', 0, 0),
(2990048, 204011, '/panoramas/2.5.2.jpg', 'Коридор', '', 0, 0),
(2990049, 204021, '/panoramas/2.5.3.jpg', 'Коридор', '', 0, 0),
(2990050, 204019, '/panoramas/2.5.4.jpg', 'Перед лестницей', '', 0, 0),
(2990051, 204020, '/panoramas/2.5.5.jpg', 'Тупик', '', 0, 0),
(2990052, 204005, '/panoramas/2.5.6.jpg', 'Коридор', '', 0, 0),
(2990053, 204003, '/panoramas/2.5.7.jpg', 'Коридор', '', 0, 0),
(2990054, 204002, '/panoramas/2.5.8.jpg', 'У лестницы', '', 0, 0),
(2990055, 204001, '/panoramas/2.5.л3.jpg', 'Лестница', '', 0, 0),
(2990056, 204017, '/panoramas/2.5.л1.jpg', 'Главная лестница', '', 0, 0),
(2990057, 204018, '/panoramas/2.5.л2.jpg', 'Лестница', '', 0, 0)
ON CONFLICT (id) DO NOTHING;

-- ОБНОВЛЕНИЕ ТОЧЕК (установка panorama_id)
UPDATE points SET panorama_id = 2990047 WHERE id = 204016;
UPDATE points SET panorama_id = 2990048 WHERE id = 204011;
UPDATE points SET panorama_id = 2990049 WHERE id = 204021;
UPDATE points SET panorama_id = 2990050 WHERE id = 204019;
UPDATE points SET panorama_id = 2990051 WHERE id = 204020;
UPDATE points SET panorama_id = 2990052 WHERE id = 204005;
UPDATE points SET panorama_id = 2990053 WHERE id = 204003;
UPDATE points SET panorama_id = 2990054 WHERE id = 204002;
UPDATE points SET panorama_id = 2990055 WHERE id = 204001;
UPDATE points SET panorama_id = 2990056 WHERE id = 204017;
UPDATE points SET panorama_id = 2990057 WHERE id = 204018;
