-- ========== 3 корпус ============
-- 1 этаж
-- ТОЧКИ
INSERT INTO points (id, building_id, floor_id, type, name, x_coord, y_coord, description, panorama_id, is_active) VALUES 
(301019, 3, 6, 1, 'Аудитория 102(3)', 47.5, 16, '', NULL, true),
(301018, 3, 6, 1, 'Аудитория 101/103(3)', 57, 20.2, '', NULL, true),
(301017, 3, 6, 1, 'Аудитория 105(3)', 53, 29.5, '', NULL, true),
(301016, 3, 6, 1, 'Аудитория 106(3)', 43.17, 35, '', NULL, true),
(301015, 3, 6, 1, 'Аудитория 104(3)', 38, 31.7, '', NULL, true),
(301014, 3, 6, 3, 'А2', 43.17, 31.7, '', NULL, true),
(301013, 3, 6, 3, 'А1', 43.17, 27.5, '', NULL, true),
(301012, 3, 6, 3, 'А', 47.5, 27.5, '', NULL, true),
(301011, 3, 6, 3, '4', 47.5, 20.7, '', NULL, true),
(301010, 3, 6, 6, 'Лестница', 27.5, 20.7, '', NULL, true),
(301009, 3, 6, 1, 'Аудитория 108(3)', 41, 66, '', NULL, true),
(301008, 3, 6, 1, 'Аудитория 110(3)', 33, 70.5, '', NULL, true),
(301007, 3, 6, 1, 'Аудитория 107/109(3)', 52.5, 69.5, '', NULL, true),
(301006, 3, 6, 1, 'Аудитория 111(3)', 57, 79, '', NULL, true),
(301005, 3, 6, 1, 'Аудитория 112/113(3)', 50, 91.5, '', NULL, true),
(301004, 3, 6, 3, '3', 46, 70.5, '', NULL, true),
(301003, 3, 6, 3, '2', 50, 87, '', NULL, true),
(301002, 3, 6, 6, 'Лестница', 26, 79, '', NULL, true),
(301001, 3, 6, 3, '1', 50, 79, '', NULL, true),
(301021, 3, 6, 7, 'Выход из 3 корпуса 2', 3.5, 20.7, '', NULL, true),
(301020, 3, 6, 7, 'Выход из 3 корпуса 1', 3.5, 79, '', NULL, true)
ON CONFLICT (id) DO NOTHING;
-- РЁБРА
INSERT INTO edges (id, from_point_id, to_point_id, distance_meters, direction_text, floor_transition) VALUES 
(3010001, 301002, 301001, 2.06, '', false),
(3010002, 301006, 301001, 0.6, '', false),
(3010003, 301001, 301003, 2.01, '', false),
(3010004, 301005, 301003, 1.13, '', false),
(3010005, 301001, 301004, 2.16, '', false),
(3010006, 301008, 301004, 1.12, '', false),
(3010007, 301007, 301004, 0.61, '', false),
(3010008, 301009, 301004, 1.21, '', false),
(3010009, 301011, 301010, 1.72, '', false),
(3010010, 301011, 301019, 1.18, '', false),
(3010011, 301018, 301011, 0.83, '', false),
(3010012, 301011, 301012, 1.71, '', false),
(3010013, 301012, 301013, 0.37, '', false),
(3010014, 301017, 301012, 0.69, '', false),
(3010015, 301013, 301014, 1.06, '', false),
(3010016, 301015, 301014, 0.44, '', false),
(3010017, 301016, 301014, 0.83, '', false),
(3010018, 301020, 301002, 1.93, '', false),
(3010019, 301021, 301010, 2.06, '', false)
ON CONFLICT (id) DO NOTHING;
-- 2 этаж
-- ТОЧКИ
INSERT INTO points (id, building_id, floor_id, type, name, x_coord, y_coord, description, panorama_id, is_active) VALUES 
(302020, 3, 7, 1, 'Аудитория 201/202(3)', 53.5, 19.2, '', NULL, true),
(302019, 3, 7, 1, 'Аудитория 204(3)', 35, 31.5, '', NULL, true),
(302018, 3, 7, 1, 'Аудитория 203(3)', 53.5, 31, '', NULL, true),
(302017, 3, 7, 3, 'А4', 47.5, 31, '', NULL, true),
(302016, 3, 7, 1, 'Аудитория 205(3)', 53.5, 39.5, '', NULL, true),
(302015, 3, 7, 3, 'А3', 47.5, 39.5, '', NULL, true),
(302014, 3, 7, 3, 'А2', 47.5, 43.3, '', NULL, true),
(302013, 3, 7, 1, 'Аудитория 206(3)', 41.5, 43.3, '', NULL, true),
(302012, 3, 7, 1, 'Аудитория 207(3)', 53.5, 62.5, '', NULL, true),
(302011, 3, 7, 3, 'А1', 47.5, 62.5, '', NULL, true),
(302010, 3, 7, 1, 'Аудитория 208(3)', 41.5, 62.5, '', NULL, true),
(302009, 3, 7, 1, 'Аудитория 210(3)', 35, 70, '', NULL, true),
(302008, 3, 7, 3, 'А', 47.5, 70, '', NULL, true),
(302007, 3, 7, 1, 'Аудитория 209(3)', 53.5, 70, '', NULL, true),
(302006, 3, 7, 1, 'Аудитория 211(3)', 53.5, 79.5, '', NULL, true),
(302005, 3, 7, 6, 'Лестница', 25.54, 20.5, '', NULL, true),
(302004, 3, 7, 3, '3', 45, 20.5, '', NULL, true),
(302003, 3, 7, 3, '2', 47.5, 52.5, '', NULL, true),
(302002, 3, 7, 3, '1', 45, 79.5, '', NULL, true),
(302001, 3, 7, 6, 'Лестница', 25, 79.5, '', NULL, true)
ON CONFLICT (id) DO NOTHING;
-- РЁБРА
INSERT INTO edges (id, from_point_id, to_point_id, distance_meters, direction_text, floor_transition) VALUES 
(3020001, 302001, 302002, 1.68, '', false),
(3020002, 302006, 302002, 0.71, '', false),
(3020003, 302002, 302008, 2.4, '', false),
(3020004, 302007, 302008, 0.5, '', false),
(3020005, 302009, 302008, 1.05, '', false),
(3020006, 302008, 302011, 1.88, '', false),
(3020007, 302010, 302011, 0.5, '', false),
(3020008, 302012, 302011, 0.5, '', false),
(3020009, 302003, 302011, 2.51, '', false),
(3020010, 302014, 302003, 2.31, '', false),
(3020011, 302013, 302014, 0.5, '', false),
(3020012, 302014, 302015, 0.96, '', false),
(3020013, 302016, 302015, 0.5, '', false),
(3020014, 302017, 302015, 2.14, '', false),
(3020015, 302019, 302017, 1.05, '', false),
(3020016, 302018, 302017, 0.5, '', false),
(3020017, 302017, 302004, 2.65, '', false),
(3020018, 302005, 302004, 1.63, '', false),
(3020019, 302020, 302004, 0.78, '', false)
ON CONFLICT (id) DO NOTHING;
-- 3 этаж
-- ТОЧКИ
INSERT INTO points (id, building_id, floor_id, type, name, x_coord, y_coord, description, panorama_id, is_active) VALUES 
(303026, 3, 8, 1, 'Аудитория 301(3)', 43, 14.8, '', NULL, true),
(303025, 3, 8, 1, 'Аудитория 302(3)', 50.5, 12.18, '', NULL, true),
(303024, 3, 8, 3, 'С7', 51.5, 14.8, '', NULL, true),
(303023, 3, 8, 3, 'С6', 51.5, 18.7, '', NULL, true),
(303022, 3, 8, 6, 'Лестница', 26.5, 21, '', NULL, true),
(303021, 3, 8, 3, '3', 51.5, 21, '', NULL, true),
(303020, 3, 8, 3, 'С5', 51.5, 23, '', NULL, true),
(303019, 3, 8, 1, 'Туалет женский (3)', 56.5, 18.7, '', NULL, true),
(303018, 3, 8, 1, 'Туалет мужской (3)', 56.5, 23, '', NULL, true),
(303017, 3, 8, 3, 'С4', 51.5, 25, '', NULL, true),
(303016, 3, 8, 3, 'С3', 54.5, 33.3, '', NULL, true),
(303015, 3, 8, 1, 'Аудитория 303(3)', 61, 33.3, '', NULL, true),
(303014, 3, 8, 1, 'Аудитория 304(3)', 46.5, 33.3, '', NULL, true),
(303013, 3, 8, 1, 'Аудитория 305(3)', 61, 50.2, '', NULL, true),
(303012, 3, 8, 1, 'Аудитория 306(3)', 46.5, 50.2, '', NULL, true),
(303011, 3, 8, 3, 'С2', 54.5, 50.2, '', NULL, true),
(303010, 3, 8, 1, 'Аудитория 308(3)', 46.5, 66.7, '', NULL, true),
(303009, 3, 8, 1, 'Аудитория 307(3)', 61, 66.7, '', NULL, true),
(303008, 3, 8, 3, 'С', 52, 74, '', NULL, true),
(303007, 3, 8, 3, 'С1', 54.5, 66.7, '', NULL, true),
(303006, 3, 8, 1, 'Аудитория 311(3)', 53.5, 88.5, '', NULL, true),
(303005, 3, 8, 1, 'Аудитория 310(3)', 46.5, 85.3, '', NULL, true),
(303004, 3, 8, 1, 'Аудитория 309(3)', 69.5, 85.5, '', NULL, true),
(303003, 3, 8, 3, 'А', 52, 85.5, '', NULL, true),
(303002, 3, 8, 3, '1', 52, 79, '', NULL, true),
(303001, 3, 8, 6, 'Лестница', 25.5, 79, '', NULL, true)
ON CONFLICT (id) DO NOTHING;
-- РЁБРА
INSERT INTO edges (id, from_point_id, to_point_id, distance_meters, direction_text, floor_transition) VALUES 
(3030001, 303001, 303002, 2.16, '', false),
(3030002, 303002, 303003, 1.59, '', false),
(3030003, 303005, 303003, 0.45, '', false),
(3030004, 303006, 303003, 0.74, '', false),
(3030005, 303003, 303004, 1.43, '', false),
(3030006, 303002, 303008, 1.22, '', false),
(3030007, 303007, 303008, 1.8, '', false),
(3030008, 303010, 303007, 0.65, '', false),
(3030009, 303009, 303007, 0.53, '', false),
(3030010, 303007, 303011, 4.04, '', false),
(3030011, 303012, 303011, 0.65, '', false),
(3030012, 303013, 303011, 0.53, '', false),
(3030013, 303011, 303016, 4.14, '', false),
(3030014, 303014, 303016, 0.65, '', false),
(3030015, 303015, 303016, 0.53, '', false),
(3030016, 303017, 303016, 2.05, '', false),
(3030017, 303020, 303017, 0.49, '', false),
(3030018, 303018, 303020, 0.41, '', false),
(3030019, 303020, 303021, 0.49, '', false),
(3030020, 303021, 303022, 2.04, '', false),
(3030021, 303023, 303021, 0.56, '', false),
(3030022, 303023, 303019, 0.41, '', false),
(3030023, 303024, 303023, 0.96, '', false),
(3030024, 303025, 303024, 0.65, '', false),
(3030025, 303026, 303024, 0.69, '', false)
ON CONFLICT (id) DO NOTHING;

-- лестницы
INSERT INTO edges (id, from_point_id, to_point_id, distance_meters, direction_text, floor_transition) VALUES 
(3020020, 301002, 302001, 7, '', true),
(3030026, 302001, 303001, 7, '', true),
(3020027, 303022, 302005, 7, '', true),
(3010028, 302005, 301010, 7, '', true)
ON CONFLICT (id) DO NOTHING;
